{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-VULN_TYPE",
    "2": "B-CVE_ID",
    "3": "B-IMPACT",
    "4": "B-SEVERITY",
    "5": "B-CWE_ID",
    "6": "B-CVSS_SCORE",
    "7": "B-CVSS_VECTOR",
    "8": "B-CPE",
    "9": "B-REMEDIATION",
    "10": "B-PATCH",
    "11": "B-MITIGATION",
    "12": "B-PRODUCT",
    "13": "B-VENDOR",
    "14": "B-VERSION",
    "15": "B-AFFECTED_COMPONENT",
    "16": "B-ASSET",
    "17": "B-ENDPOINT",
    "18": "B-SERVICE",
    "19": "B-IP_ADDRESS",
    "20": "B-IP_RANGE",
    "21": "B-URL",
    "22": "B-DOMAIN",
    "23": "B-EMAIL",
    "24": "B-PORT",
    "25": "B-FILE_PATH",
    "26": "B-FILE_NAME",
    "27": "B-MD5",
    "28": "B-SHA1",
    "29": "B-SHA256",
    "30": "B-HASH",
    "31": "B-MALWARE",
    "32": "B-ATTACK_VECTOR",
    "33": "B-ATTACK_TECHNIQUE",
    "34": "B-MITRE_TECHNIQUE",
    "35": "B-THREAT_ACTOR",
    "36": "B-EXPLOIT",
    "37": "B-EXPLOIT_AVAILABLE",
    "38": "B-RISK_LEVEL",
    "39": "B-EXPLOITABILITY",
    "40": "B-CONFIDENTIALITY_IMPACT",
    "41": "B-INTEGRITY_IMPACT",
    "42": "B-AVAILABILITY_IMPACT",
    "43": "I-VULN_TYPE",
    "44": "I-CVE_ID",
    "45": "I-IMPACT",
    "46": "I-SEVERITY",
    "47": "I-CWE_ID",
    "48": "I-CVSS_SCORE",
    "49": "I-CVSS_VECTOR",
    "50": "I-CPE",
    "51": "I-REMEDIATION",
    "52": "I-PATCH",
    "53": "I-MITIGATION",
    "54": "I-PRODUCT",
    "55": "I-VENDOR",
    "56": "I-VERSION",
    "57": "I-AFFECTED_COMPONENT",
    "58": "I-ASSET",
    "59": "I-ENDPOINT",
    "60": "I-SERVICE",
    "61": "I-IP_ADDRESS",
    "62": "I-IP_RANGE",
    "63": "I-URL",
    "64": "I-DOMAIN",
    "65": "I-EMAIL",
    "66": "I-PORT",
    "67": "I-FILE_PATH",
    "68": "I-FILE_NAME",
    "69": "I-MD5",
    "70": "I-SHA1",
    "71": "I-SHA256",
    "72": "I-HASH",
    "73": "I-MALWARE",
    "74": "I-ATTACK_VECTOR",
    "75": "I-ATTACK_TECHNIQUE",
    "76": "I-MITRE_TECHNIQUE",
    "77": "I-THREAT_ACTOR",
    "78": "I-EXPLOIT",
    "79": "I-EXPLOIT_AVAILABLE",
    "80": "I-RISK_LEVEL",
    "81": "I-EXPLOITABILITY",
    "82": "I-CONFIDENTIALITY_IMPACT",
    "83": "I-INTEGRITY_IMPACT",
    "84": "I-AVAILABILITY_IMPACT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-AFFECTED_COMPONENT": 15,
    "B-ASSET": 16,
    "B-ATTACK_TECHNIQUE": 33,
    "B-ATTACK_VECTOR": 32,
    "B-AVAILABILITY_IMPACT": 42,
    "B-CONFIDENTIALITY_IMPACT": 40,
    "B-CPE": 8,
    "B-CVE_ID": 2,
    "B-CVSS_SCORE": 6,
    "B-CVSS_VECTOR": 7,
    "B-CWE_ID": 5,
    "B-DOMAIN": 22,
    "B-EMAIL": 23,
    "B-ENDPOINT": 17,
    "B-EXPLOIT": 36,
    "B-EXPLOITABILITY": 39,
    "B-EXPLOIT_AVAILABLE": 37,
    "B-FILE_NAME": 26,
    "B-FILE_PATH": 25,
    "B-HASH": 30,
    "B-IMPACT": 3,
    "B-INTEGRITY_IMPACT": 41,
    "B-IP_ADDRESS": 19,
    "B-IP_RANGE": 20,
    "B-MALWARE": 31,
    "B-MD5": 27,
    "B-MITIGATION": 11,
    "B-MITRE_TECHNIQUE": 34,
    "B-PATCH": 10,
    "B-PORT": 24,
    "B-PRODUCT": 12,
    "B-REMEDIATION": 9,
    "B-RISK_LEVEL": 38,
    "B-SERVICE": 18,
    "B-SEVERITY": 4,
    "B-SHA1": 28,
    "B-SHA256": 29,
    "B-THREAT_ACTOR": 35,
    "B-URL": 21,
    "B-VENDOR": 13,
    "B-VERSION": 14,
    "B-VULN_TYPE": 1,
    "I-AFFECTED_COMPONENT": 57,
    "I-ASSET": 58,
    "I-ATTACK_TECHNIQUE": 75,
    "I-ATTACK_VECTOR": 74,
    "I-AVAILABILITY_IMPACT": 84,
    "I-CONFIDENTIALITY_IMPACT": 82,
    "I-CPE": 50,
    "I-CVE_ID": 44,
    "I-CVSS_SCORE": 48,
    "I-CVSS_VECTOR": 49,
    "I-CWE_ID": 47,
    "I-DOMAIN": 64,
    "I-EMAIL": 65,
    "I-ENDPOINT": 59,
    "I-EXPLOIT": 78,
    "I-EXPLOITABILITY": 81,
    "I-EXPLOIT_AVAILABLE": 79,
    "I-FILE_NAME": 68,
    "I-FILE_PATH": 67,
    "I-HASH": 72,
    "I-IMPACT": 45,
    "I-INTEGRITY_IMPACT": 83,
    "I-IP_ADDRESS": 61,
    "I-IP_RANGE": 62,
    "I-MALWARE": 73,
    "I-MD5": 69,
    "I-MITIGATION": 53,
    "I-MITRE_TECHNIQUE": 76,
    "I-PATCH": 52,
    "I-PORT": 66,
    "I-PRODUCT": 54,
    "I-REMEDIATION": 51,
    "I-RISK_LEVEL": 80,
    "I-SERVICE": 60,
    "I-SEVERITY": 46,
    "I-SHA1": 70,
    "I-SHA256": 71,
    "I-THREAT_ACTOR": 77,
    "I-URL": 63,
    "I-VENDOR": 55,
    "I-VERSION": 56,
    "I-VULN_TYPE": 43,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 514,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.9.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 52000
}
